In [16]:
from IPython.display import IFrame, display

# I Prodsonen
Kan vi laste sas-data rett fra linux-stammene, men ikke fra S: - H: - X:

### Video: Hvordan få edx-kursmateriell inn i prodsonen

In [3]:
IFrame("https://web.microsoftstream.com/embed/video/18ae1be3-a6c5-4bb6-83dc-9319e15d0ed2?autoplay=false&showinfo=true", 
       width = 640, 
       height = 360)

### Video: Python i prodsonen med stammedata

In [4]:
IFrame("https://web.microsoftstream.com/embed/video/5bc50672-5fd8-4369-9075-8b5a4047a938?autoplay=false&showinfo=true", 
       width = 640, 
       height = 360)

Simens post på yammer om at man kanskje bør velge prodsonen å lære seg først:\
https://web.yammer.com/main/threads/eyJfdHlwZSI6IlRocmVhZCIsImlkIjoiMTA2NDYwNTc5MTk5Mzg1NiJ9

Annonsering av Jupyterversjonen:\
https://web.yammer.com/main/threads/eyJfdHlwZSI6IlRocmVhZCIs...

I prodsonen - citrix bruk Chrome og gå til adressen:\
https://sl-python-02.ssb.no:8443

In [ ]:
# Eksempel innlastingskode av sasdata (mediebruksundersøkelsen)
stammepath = '/ssb/stamme03/kultmed/aar2020/wk24/medie_vekt_alle2020.sas7bdat'
df = pd.read_sas(stammepath, format = 'sas7bdat', encoding ='iso-8859-1')

"Root"-mappen din i denne instansen er "hjem-mappen" din på linux.

#### Kan vi skrive sas-data tilbake igjen?
https://stackoverflow.com/questions/49235845/export-pandas-dataframe-to-sas-sas7bdat-format \
Nei? Men vi kan kanskje skrive ett pythonscript for å generere "innlastings-SAS-kode"...

Bitbucket er ett git-alternativ til github.com og er delt mellom prodsonen og adminsonen, og kan nås på adressen:\
https://git-adm.ssb.no/

<hr>

# På Dapla

### Video:Hvordan få edx-kursmateriell inn i Dapla

In [5]:
IFrame("https://web.microsoftstream.com/embed/video/9050c302-922f-4f39-b592-4f258ffc97c2?autoplay=false&showinfo=true", 
       width = 640, 
       height = 360)

## På dapla har vi biblioteket "dapla"
Men dette kan potensielt endre seg veldig snart

In [2]:
import dapla as dp
help(dp.execute)

Help on module dapla.execute in dapla:

NAME
    dapla.execute

FUNCTIONS
    details(path)

    read_pandas(path, columns=None)
        Read Parquet data from a path in Dapla.

        Parameters
        ----------
        path : str
            A path that will be mapped to a GCS path in Dapla
        columns : List[str], optional
            Subset of columns to read.

        Returns
        -------
        pyarrow.Table
            Content as a table (of columns).

    show(path)

    show_meta(path)

    write_pandas(df, path, **option_kwargs)

FILE
    /opt/conda/lib/python3.8/site-packages/dapla/execute.py

In [3]:
# Det du får fra dp.show() er egentlig bare en dataframe...
dp.show('/felles/mock')

                                              path               timestamp
0    /felles/mock_sysselsatte/companies_2019_10000 2021-02-23 09:44:16.678
1    /felles/mock_sysselsatte/companies_2019_30000 2021-03-03 07:05:35.853
2    /felles/mock_sysselsatte/companies_2020_10000 2021-02-26 16:00:24.381
3    /felles/mock_sysselsatte/companies_2020_30000 2021-03-03 11:00:33.237
4    /felles/mock_sysselsatte/companies_2021_10000 2021-02-26 16:01:25.697
5    /felles/mock_sysselsatte/companies_2021_30000 2021-03-03 11:05:14.427
6    /felles/mock_sysselsatte/companies_2022_10000 2021-02-26 16:02:25.987
7    /felles/mock_sysselsatte/companies_2022_30000 2021-03-03 11:10:23.890
8    /felles/mock_sysselsatte/companies_2023_10000 2021-02-26 16:03:14.080
9    /felles/mock_sysselsatte/companies_2023_30000 2021-03-03 11:14:50.105
10   /felles/mock_sysselsatte/companies_2024_30000 2021-03-03 09:56:22.390
11  /felles/mock_sysselsatte/population_2019_10000 2021-02-23 09:44:18.095
12  /felles/mock_sysselsatte/population_2019_30000 2021-03-03 07:05:37.135
13  /felles/mock_sysselsatte/population_2020_10000 2021-02-26 16:00:25.598
14  /felles/mock_sysselsatte/population_2020_30000 2021-03-03 11:00:35.487
15  /felles/mock_sysselsatte/population_2021_10000 2021-02-26 16:01:26.650
16  /felles/mock_sysselsatte/population_2021_30000 2021-03-03 11:05:15.945
17  /felles/mock_sysselsatte/population_2022_10000 2021-02-26 16:02:26.930
18  /felles/mock_sysselsatte/population_2022_30000 2021-03-03 11:10:24.872
19  /felles/mock_sysselsatte/population_2023_10000 2021-02-26 16:03:15.012
20  /felles/mock_sysselsatte/population_2023_30000 2021-03-03 11:14:50.821
21  /felles/mock_sysselsatte/population_2024_30000 2021-03-03 09:56:23.683

In [4]:
# Og kan manipuleres på samme måte som andre dataframes
# Her loop over path-kolonnen
for x in dp.show('/felles/mock')['path']: 
    # print kun de som har "comp" og "30000" i navnet
    if 'comp' in x and '30000' in x: 
        print(x)
    #else:
    #    print("No match")

/felles/mock_sysselsatte/companies_2019_30000
/felles/mock_sysselsatte/companies_2020_30000
/felles/mock_sysselsatte/companies_2021_30000
/felles/mock_sysselsatte/companies_2022_30000
/felles/mock_sysselsatte/companies_2023_30000
/felles/mock_sysselsatte/companies_2024_30000

In [5]:
dp.show('/felles/mock')['path'][0]

'/felles/mock_sysselsatte/companies_2019_10000'

### Lesing fra Dapla-lagringen

In [6]:
# Les inn ett av datasettene, med en hardkodet path
df = dp.read_pandas('/felles/mock_sysselsatte/companies_2019_30000')
df.sample(10)

        work_id    nace region_code                   region  employee_points
213   542560959  46.731          12        Hordaland (-2019)               14
1122  339156086  23.990          06         Buskerud (-2019)               24
1056  138049867  15.200          04          Hedmark (-2019)                3
848   754525073  47.789          15          Møre og Romsdal                9
676   088518316  51.210          50  Trøndelag - Trööndelage               15
778   873045945  50.204          50  Trøndelag - Trööndelage               18
144   241628580  24.510          06         Buskerud (-2019)               28
894   302118946  35.112          09       Aust-Agder (-2019)                5
679   293763048  43.341          10       Vest-Agder (-2019)               21
1027  125479936  35.130          09       Aust-Agder (-2019)                4

### Skriving til datalagringen på Dapla

Du bør vite hva du gjør når du skriver tilbake til dapla. \
Bla. skal verdivurdering være med som parameter, og "state" på dataene. \
Det er pågående diskusjoner om hvordan dette skal håndheves fremover: \
https://ssb-norge.slack.com/archives/C019P6L5SBV/p1611228000005500?thread_ts=1611220403.003000&cid=C019P6L5SBV

In [ ]:
dp.write_pandas(df, '/felles/mock_sysselsatte/companies_2019_30000', 
                valuation='INTERNAL', 
                state= 'INPUT')

### Bonus: Mer avansert teknikk med en "dict"-comprehension

In [41]:
# Last inn alle dataframene med "comp" og "30000" i navnet i en mappe på dapla inn i en dict, hvor deler av pathen er keyen.
comp_years = {x.replace('/felles/mock_sysselsatte/',''): dp.read_pandas(x)
              for x in dp.show('/felles/mock')['path'] 
              if 'comp' in x and '30000' in x}

In [42]:
# Se på keyene, dvs. navnene vi kan indexe i dicten med
comp_years.keys()

dict_keys(['companies_2019_30000', 'companies_2020_30000', 'companies_2021_30000', 'companies_2022_30000', 'companies_2023_30000', 'companies_2024_30000'])

In [44]:
# feks.
comp_years['companies_2019_30000']

        work_id    nace region_code                   region  employee_points
0     118415099  11.070          03                     Oslo               60
1     165189001  10.920          03                     Oslo               54
2     205912967  10.130          02         Akershus (-2019)               48
3     959013544  46.693          12        Hordaland (-2019)               46
4     405013223  09.900          02         Akershus (-2019)               88
...         ...     ...         ...                      ...              ...
1128  706734220  51.210          50  Trøndelag - Trööndelage               15
1129  156404021  74.200          18                 Nordland               23
1130  962214437  74.102          18                 Nordland               12
1131  999083400  43.341          10       Vest-Agder (-2019)               21
1132  438579667  27.900          07         Vestfold (-2019)               16

[1133 rows x 5 columns]

In [43]:
# Print første rad i hver av dataframene
for k, df in comp_years.items(): 
    print(k)
    display(df.head(1))

companies_2019_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60

companies_2020_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60

companies_2021_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60

companies_2022_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60

companies_2023_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60

companies_2024_30000

     work_id    nace region_code region  employee_points
0  118415099  11.070          03   Oslo               60